; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v3 ?v9)
             (pred_6 ?v4 ?v1)
             (pred_1 ?v3 ?v1)
             (pred_5 ?v7 ?v3 )
	     (pred_4 ?v3)
             (pred_8 ?v11)
             (pred_11 ?v4)
             (pred_3 ?v1)
             (pred_12 ?v3)
             (pred_2 ?v4)
             (pred_10 ?v3)
             (pred_9 ))



(:action op_3
:parameters (?v2 ?v8 ?v12 ?v5)
:precondition (and (pred_8 ?v2) (pred_8 ?v8) (pred_11 ?v12) (pred_3 ?v5)
          (pred_7 ?v2 ?v8) (pred_6 ?v12 ?v5)
                   (pred_1 ?v8 ?v5) (pred_4 ?v2) 
                   (pred_12 ?v8) (pred_2 ?v12))
:effect (and  (pred_10 ?v8) (not (pred_12 ?v8))))


(:action op_2
:parameters (?v2 ?v13)
:precondition (and (pred_8 ?v2) (pred_8 ?v13)
               (pred_4 ?v2) (pred_7 ?v2 ?v13) (pred_10 ?v13))
:effect (and (pred_4 ?v13) (not (pred_4 ?v2))))

(:action op_5
:parameters (?v2 ?v12)
:precondition (and (pred_8 ?v2) (pred_11 ?v12) 
                  (pred_4 ?v2) (pred_5 ?v12 ?v2) (pred_9 ))
:effect (and (pred_2 ?v12)
   (not (pred_5 ?v12 ?v2)) (not (pred_9 ))))


(:action op_1
:parameters (?v2 ?v10 ?v6)
:precondition (and (pred_8 ?v2) (pred_11 ?v10) (pred_11 ?v6)
                  (pred_4 ?v2) (pred_2 ?v6) (pred_5 ?v10 ?v2))
:effect (and (pred_2 ?v10) (pred_5 ?v6 ?v2)
        (not (pred_2 ?v6)) (not (pred_5 ?v10 ?v2))))

(:action op_4
:parameters (?v2 ?v12)
:precondition (and (pred_8 ?v2) (pred_11 ?v12) 
                  (pred_4 ?v2) (pred_2 ?v12))
:effect (and (pred_9 ) (pred_5 ?v12 ?v2) (not (pred_2 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_14 obj_10 obj_16 obj_03 obj_26 obj_25 obj_27 obj_06 obj_19 obj_02 obj_17 obj_08 obj_11 obj_05 obj_23 obj_21 obj_28 obj_13 obj_15 obj_29 obj_04 obj_07 obj_09 obj_22
    obj_20 obj_30
    obj_24 obj_12 obj_01
    )

    (:init
       (pred_9)

       (pred_8 obj_18)
       (pred_8 obj_14)
       (pred_8 obj_10)
       (pred_8 obj_16)
       (pred_8 obj_03)
       (pred_8 obj_26)
       (pred_8 obj_25)
       (pred_8 obj_27)
       (pred_8 obj_06)
       (pred_8 obj_19)
       (pred_8 obj_02)
       (pred_8 obj_17)
       (pred_8 obj_08)
       (pred_8 obj_11)
       (pred_8 obj_05)
       (pred_8 obj_23)
       (pred_8 obj_21)
       (pred_8 obj_28)
       (pred_8 obj_13)
       (pred_8 obj_15)
       (pred_8 obj_29)
       (pred_8 obj_04)
       (pred_8 obj_07)
       (pred_8 obj_09)
       (pred_8 obj_22)
       (pred_3 obj_20)
       (pred_3 obj_30)
       (pred_11 obj_24)
       (pred_11 obj_12)
       (pred_11 obj_01)

       (pred_7 obj_18 obj_26)
       (pred_7 obj_18 obj_14)
       (pred_7 obj_14 obj_25)
       (pred_7 obj_14 obj_10)
       (pred_7 obj_14 obj_18)
       (pred_7 obj_10 obj_27)
       (pred_7 obj_10 obj_16)
       (pred_7 obj_10 obj_14)
       (pred_7 obj_16 obj_06)
       (pred_7 obj_16 obj_03)
       (pred_7 obj_16 obj_10)
       (pred_7 obj_03 obj_19)
       (pred_7 obj_03 obj_16)
       (pred_7 obj_26 obj_02)
       (pred_7 obj_26 obj_25)
       (pred_7 obj_26 obj_18)
       (pred_7 obj_25 obj_17)
       (pred_7 obj_25 obj_27)
       (pred_7 obj_25 obj_14)
       (pred_7 obj_25 obj_26)
       (pred_7 obj_27 obj_08)
       (pred_7 obj_27 obj_06)
       (pred_7 obj_27 obj_10)
       (pred_7 obj_27 obj_25)
       (pred_7 obj_06 obj_11)
       (pred_7 obj_06 obj_19)
       (pred_7 obj_06 obj_16)
       (pred_7 obj_06 obj_27)
       (pred_7 obj_19 obj_05)
       (pred_7 obj_19 obj_03)
       (pred_7 obj_19 obj_06)
       (pred_7 obj_02 obj_23)
       (pred_7 obj_02 obj_17)
       (pred_7 obj_02 obj_26)
       (pred_7 obj_17 obj_21)
       (pred_7 obj_17 obj_08)
       (pred_7 obj_17 obj_25)
       (pred_7 obj_17 obj_02)
       (pred_7 obj_08 obj_28)
       (pred_7 obj_08 obj_11)
       (pred_7 obj_08 obj_27)
       (pred_7 obj_08 obj_17)
       (pred_7 obj_11 obj_13)
       (pred_7 obj_11 obj_05)
       (pred_7 obj_11 obj_06)
       (pred_7 obj_11 obj_08)
       (pred_7 obj_05 obj_15)
       (pred_7 obj_05 obj_19)
       (pred_7 obj_05 obj_11)
       (pred_7 obj_23 obj_29)
       (pred_7 obj_23 obj_21)
       (pred_7 obj_23 obj_02)
       (pred_7 obj_21 obj_04)
       (pred_7 obj_21 obj_28)
       (pred_7 obj_21 obj_17)
       (pred_7 obj_21 obj_23)
       (pred_7 obj_28 obj_07)
       (pred_7 obj_28 obj_13)
       (pred_7 obj_28 obj_08)
       (pred_7 obj_28 obj_21)
       (pred_7 obj_13 obj_09)
       (pred_7 obj_13 obj_15)
       (pred_7 obj_13 obj_11)
       (pred_7 obj_13 obj_28)
       (pred_7 obj_15 obj_22)
       (pred_7 obj_15 obj_05)
       (pred_7 obj_15 obj_13)
       (pred_7 obj_29 obj_04)
       (pred_7 obj_29 obj_23)
       (pred_7 obj_04 obj_07)
       (pred_7 obj_04 obj_21)
       (pred_7 obj_04 obj_29)
       (pred_7 obj_07 obj_09)
       (pred_7 obj_07 obj_28)
       (pred_7 obj_07 obj_04)
       (pred_7 obj_09 obj_22)
       (pred_7 obj_09 obj_13)
       (pred_7 obj_09 obj_07)
       (pred_7 obj_22 obj_15)
       (pred_7 obj_22 obj_09)
       (pred_12 obj_14)
       (pred_12 obj_16)
       (pred_12 obj_15)
       (pred_1  obj_14 obj_20)
       (pred_1  obj_16 obj_30)
       (pred_1  obj_15 obj_30)
       (pred_10 obj_18)
       (pred_10 obj_10)
       (pred_10 obj_03)
       (pred_10 obj_26)
       (pred_10 obj_25)
       (pred_10 obj_27)
       (pred_10 obj_06)
       (pred_10 obj_19)
       (pred_10 obj_02)
       (pred_10 obj_17)
       (pred_10 obj_08)
       (pred_10 obj_11)
       (pred_10 obj_05)
       (pred_10 obj_23)
       (pred_10 obj_21)
       (pred_10 obj_28)
       (pred_10 obj_13)
       (pred_10 obj_29)
       (pred_10 obj_04)
       (pred_10 obj_07)
       (pred_10 obj_09)
       (pred_10 obj_22)

       (pred_6  obj_24 obj_20)
       (pred_6  obj_12 obj_30)
       (pred_6  obj_01 obj_30)
       (pred_5 obj_24 obj_19)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_01 obj_27)
       (pred_4 obj_08)
    )

    (:goal (and
       (pred_5 obj_24 obj_04)
       (pred_5 obj_12 obj_10)
       (pred_5 obj_01 obj_25)
    ))
(:constraints
  (always (not (pred_4 obj_06)))
)
)

; plan
1. (op_2 obj_08 obj_27)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_27)
   goals met: 0 of 3
2. (op_5 obj_27 obj_01)
   deleted: (pred_5 obj_01 obj_27) (pred_9)
   added: (pred_2 obj_01)
   goals met: 0 of 3
3. (op_2 obj_27 obj_25)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_25)
   goals met: 0 of 3
4. (op_4 obj_25 obj_01)
   deleted: (pred_2 obj_01)
   added: (pred_9) (pred_5 obj_01 obj_25)
   goals met: 1 of 3
5. (op_2 obj_25 obj_17)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_17)
   goals met: 1 of 3
6. (op_2 obj_17 obj_02)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_02)
   goals met: 1 of 3
7. (op_5 obj_02 obj_12)
   deleted: (pred_5 obj_12 obj_02) (pred_9)
   added: (pred_2 obj_12)
   goals met: 1 of 3
8. (op_2 obj_02 obj_17)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_17)
   goals met: 1 of 3
9. (op_2 obj_17 obj_25)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_25)
   goals met: 1 of 3
10. (op_2 obj_25 obj_27)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_27)
   goals met: 1 of 3
11. (op_2 obj_27 obj_10)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_10)
   goals met: 1 of 3
12. (op_4 obj_10 obj_12)
   deleted: (pred_2 obj_12)
   added: (pred_9) (pred_5 obj_12 obj_10)
   goals met: 2 of 3
13. (op_2 obj_10 obj_27)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_27)
   goals met: 2 of 3
14. (op_2 obj_27 obj_08)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_08)
   goals met: 2 of 3
15. (op_2 obj_08 obj_11)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_11)
   goals met: 2 of 3
16. (op_2 obj_11 obj_05)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_05)
   goals met: 2 of 3
17. (op_2 obj_05 obj_19)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_19)
   goals met: 2 of 3
18. (op_5 obj_19 obj_24)
   deleted: (pred_5 obj_24 obj_19) (pred_9)
   added: (pred_2 obj_24)
   goals met: 2 of 3
19. (op_2 obj_19 obj_05)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_05)
   goals met: 2 of 3
20. (op_2 obj_05 obj_11)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_11)
   goals met: 2 of 3
21. (op_2 obj_11 obj_08)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_08)
   goals met: 2 of 3
22. (op_2 obj_08 obj_17)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_17)
   goals met: 2 of 3
23. (op_2 obj_17 obj_21)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_21)
   goals met: 2 of 3
24. (op_2 obj_21 obj_04)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_04)
   goals met: 2 of 3
25. (op_4 obj_04 obj_24)
   deleted: (pred_2 obj_24)
   added: (pred_9) (pred_5 obj_24 obj_04)
   goals met: 3 of 3
